Appiko/nrf5x-firmware/codebase/peripheral_modules/LSM6DS3.c
/* 
 * File:   LSM6DS3.c
 * Copyright (c) 2017, Electronut Labs All rights reserved.
 * Copyright (c) 2018 Appiko
 * Created on 26 February, 2019, 12:54 PM
 * Author:  Tejas Vasekar (https://github.com/tejas-tj)
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE
 */
/**
 * LSM6DS3.h
 *
 * nRF52 TWI interface for LSM6DS3 IMU.
 *
 * Electronut Labs
 * electronut.in
 */


#include "stdlib.h"
#include "time.h"
#include "LSM6DS3.h"
#include "hal_twim.h"
#include "common_util.h"
#include "app_error.h"
#include "log.h"
#include "nrf_util.h"
#include "hal_nop_delay.h"
uint8_t who_am_i = 0;
static struct IMU_settings settings;

uint8_t * p_lsm3d_ = (uint8_t *)LSM6DS3_ADDR;

void twim_evt_handler (twim_err_t evt, twim_transfer_t transfer)
{
//    log_printf("%s : %d, %d\n", __func__, evt, transfer);
}

hal_twim_init_config_t LSM6D_twi_config = 
{
    .address = LSM6DS3_ADDR,
    .irq_priority = APP_IRQ_PRIORITY_MID,
    .evt_handler = twim_evt_handler,
    .sda = SDA_PIN,
    .scl = SCL_PIN,
    .evt_mask = (TWIM_TX_RX_DONE_MSK|TWIM_RX_DONE_MSK|TWIM_TX_DONE_MSK),
    .frequency = HAL_TWI_FREQ_100K,
};



/**
 * @brief function to test availablility of IMU by reading WHO_AM_I register.
 */
void LSM6DS3_who_am_i(void)
{
  twim_ret_status err_code;
  uint8_t  p_wmi_reg = WHO_AM_I;
//  log_printf("Pointer : %x\n",*p_wmi_reg);
  err_code = hal_twim_tx_rx (&p_wmi_reg, sizeof(who_am_i), &who_am_i, sizeof(who_am_i));
  
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, WHO_AM_I, &who_am_i, 1, false);
  
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
    log_printf("%s : %x\n",__func__, who_am_i);
}


/**
 * @brief function to initialize IMU sensor.
 */
void LSM6DS3_init(void)
{
    hal_twim_init (&LSM6D_twi_config);

  twim_ret_status err_code;

  settings.accel_enable           = 1;      // 0 - Disable. 1 - Enable
  settings.accel_range            = 2;      // Full Scale(FS) range (in g). Select from: 2, 4, 8, 16
  settings.accel_samplerate       = 13;    // Hz. Select from: 13, 26, 52, 104, 208, 416, 833, 1666
  settings.accel_bandwidth        = 100;    // Hz. Select from: 50, 100, 200, 400
  settings.accel_FIFO_enable      = 0;      // Set to include accelerometer data in FIFO buffer
  settings.accel_FIFO_decimation  = 0;      // Set to activate.

  settings.gyro_enable            = 0;      // 0 - Disable. 1 - Enable
  settings.gyro_range             = 2000;   // Angular Rate range (in deg/s).  Can be: 125, 245, 500, 1000, 2000
	settings.gyro_samplerate        = 104;    // Hz. Select from: 13, 26, 52, 104, 208, 416, 833, 1666
	settings.gyro_bandwidth         = 200;    // Hz. Select from: 50, 100, 200, 400;
	settings.gyro_FIFO_enable       = 0;      // Set to include gyroscope data in FIFO buffer
	settings.gyro_FIFO_decimation   = 0;      // Set to activate.

	settings.temp_enable            = 0;      // Set to activate temperature measure

	//FIFO control data
	settings.FIFO_threshold 			  = 3000;    //Can be 0 to 4096 (16 bit bytes)
	settings.FIFO_samplerate 		    = 13;     //default 13Hz
	settings.FIFO_mode 			        = 6;      //Default off

  uint8_t tx_data[2] = {MASTER_CONFIG, 0x01};
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms (10);

  // set IF_INC in CTRL3_C register.
  tx_data[0] = CTRL3_C;
  tx_data[1] = 0x04;
  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms (10);
  LSM6DS3_config();
}

/**
 * @brief function to configure IMU parameters.
 *
 * Accelerometer parameters are configured using CTRL1_XL register.
 * Bit[1:0] are reserved for filter bandwidth selection. Values can be 400 Hz, 200 Hz, 100 Hz and 50 Hz
 * Bit[3:2] are reserved for full scale range selection. Values can be (+/-)2g, (+/-)4g, (+/-)8g and (+/-)16g
 * Bit[7:4] are reserved for output data rate and power mode selection.
 *
 * Gyroscope parameters are configured using CTRL2_G registers.
 * Bit[1] is reserved for full scale range selection at 125 dps.
 * Bit[3:2] are reserved for full scale range sselection from 245 dps, 500 dps, 1000 dps and 2000 dps
 * Bit[7:4] are reserved for output data rate selection.
 */
void LSM6DS3_config(void)
{
  twim_ret_status err_code;
  uint8_t tx_data[2];

  // configure accelerometer
  tx_data[0] = CTRL1_XL;
  tx_data[1] = 0;
  if(settings.accel_enable == 1) {
    // Bandwidth
    switch(settings.accel_bandwidth) {
      case 50:
              tx_data[1] |= LSM6DS3_IMU_BW_XL_50Hz;
              break;

