Appiko/nrf5x-firmware/codebase/peripheral_modules/LSM6DS3.c
      case 100:
              tx_data[1] |= LSM6DS3_IMU_BW_XL_100Hz;
              break;

      case 200:
              tx_data[1] |= LSM6DS3_IMU_BW_XL_200Hz;
              break;

      default:
      case 400:
              tx_data[1] |= LSM6DS3_IMU_BW_XL_400Hz;
              break;
    }

    // Full scale range
    switch(settings.accel_range) {
      case 2:
              tx_data[1] |= LSM6DS3_IMU_FS_XL_2g;
              break;

      case 4:
              tx_data[1] |= LSM6DS3_IMU_FS_XL_4g;
              break;

      case 8:
              tx_data[1] |= LSM6DS3_IMU_FS_XL_8g;
              break;

      default:
      case 16:
              tx_data[1] |= LSM6DS3_IMU_FS_XL_16g;
              break;
    }

    // ODR
    switch(settings.accel_samplerate) {

      case 0:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_POWER_DOWN;
              break;

      case 13:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_13Hz;
              break;

      case 26:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_26Hz;
              break;

      case 52:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_52Hz;
              break;

      default:
      case 104:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_104Hz;
              break;

      case 208:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_208Hz;
              break;

      case 416:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_416Hz;
              break;

      case 833:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_833Hz;
              break;

      case 1660:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_1660Hz;
              break;

      case 3330:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_3330Hz;
              break;

      case 6660:
              tx_data[1] |= LSM6DS3_IMU_ODR_XL_6660Hz;
              break;
    }
  }
  else {
    tx_data[1] = 0;
  }

//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  // configure gyroscope
  tx_data[0] = CTRL2_G;
  tx_data[1] = 0;
  if(settings.gyro_enable == 1) {
    // range
    switch(settings.gyro_range) {
      case 125:
              tx_data[1] |= LSM6DS3_IMU_FS_125_ENABLED;
              break;

      case 245:
              tx_data[1] |= LSM6DS3_IMU_FS_G_245dps;
              break;

      case 500:
              tx_data[1] |= LSM6DS3_IMU_FS_G_500dps;
              break;

      case 1000:
              tx_data[1] |= LSM6DS3_IMU_FS_G_1000dps;
              break;

      default:
      case 2000:
              tx_data[1] |= LSM6DS3_IMU_FS_G_2000dps;
              break;
    }

    // ODR
    switch(settings.gyro_samplerate) {
      case 13:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_13Hz;
              break;

      case 26:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_26Hz;
              break;

      case 52:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_52Hz;
              break;

      default:
      case 104:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_104Hz;
              break;

      case 208:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_208Hz;
              break;

      case 416:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_416Hz;
              break;

      case 833:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_833Hz;
              break;

      case 1660:
              tx_data[1] |= LSM6DS3_IMU_ODR_G_1660Hz;
              break;
    }
  }
  else {
    tx_data[1] = 0;
  }

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
}

/**
 * @brief function to enable power down mode in accelerometer
 *
 * setting ODR_XL[3:0] in CTRL1_XL register to 0 enables power-down mode.
 */
void LSM6DS3_set_accel_power_down_mode()
{
  twim_ret_status err_code;
  uint8_t rx_data;
  uint8_t tx_data[2] = {CTRL1_XL, 0};

  // read CTRL1_XL register to obtain current parameters.
  err_code = hal_twim_tx_rx ((uint8_t *)CTRL1_XL, 1, &rx_data, sizeof(rx_data));
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, CTRL1_XL, &rx_data, sizeof(rx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  // bit mask CTRL1_XL to avoid losing previously set parameters. Only change ODR_XL bits.
  tx_data[1] |= (0x00 << 4) | (rx_data & 0x0F);

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
}

/**
 * @brief function to enable low power mode in accelerometer
 *
 * Low power mode is enabled by setting one of the following ODR values: 13 Hz, 26Hz and 52 Hz
 */
void LSM6DS3_set_accel_low_power_mode(uint16_t value)
{
  twim_ret_status err_code;
  uint8_t rx_data;
  // uint8_t tx_data[2] = {CTRL1_XL, 0};
  uint8_t tx_data[2];

  // set XL_HM_MODE bit to 1 in CTRL6_C to enable high performance mode.
  tx_data[0] = CTRL6_C;
  tx_data[1] = 0x10;

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);


  // read CTRL1_XL register to obtain current parameters.
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, CTRL1_XL, &rx_data, sizeof(rx_data), false);
  err_code = hal_twim_tx_rx ((uint8_t *)CTRL1_XL, 1, &rx_data, sizeof(rx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  tx_data[0] = CTRL1_XL;
  // bit mask CTRL1_XL to avoid losing previously set parameters. Only change ODR_XL bits.
  switch(value) {
    case 13:
      tx_data[1] |= (0x01 << 4) | (rx_data & 0x0F);
      break;

    case 26:
      tx_data[1] |= (0x02 << 4) | (rx_data & 0x0F);
      break;

    default:
    case 52:
      tx_data[1] |= (0x03 << 4) | (rx_data & 0x0F);
      break;
  }

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
}

/**
 * @brief function to enable normal mode in accelerometer
 *
 * Normal mode is enabled by setting one of the following ODR values: 104 Hz and 208 Hz
 */
void LSM6DS3_set_accel_normal_mode(uint16_t value)
{
  twim_ret_status err_code;
  uint8_t rx_data;
  // uint8_t tx_data[2] = {CTRL1_XL, 0};
  uint8_t tx_data[2];

  // set XL_HM_MODE bit to 1 in CTRL6_C to enable high performance mode.
  tx_data[0] = CTRL6_C;
  tx_data[1] = 0x10;

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  // read CTRL1_XL register to obtain current parameters.
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, CTRL1_XL, &rx_data, sizeof(rx_data), false);
  err_code = hal_twim_tx_rx ((uint8_t *)CTRL1_XL, 1, &rx_data, sizeof(rx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  tx_data[0] = CTRL1_XL;
  // bit mask CTRL1_XL to avoid losing previously set parameters. Only change ODR_XL bits.
  switch(value) {
    default:
    case 104:
      tx_data[1] |= (0x04 << 4) | (rx_data & 0x0F);
      break;

    case 208:
      tx_data[1] |= (0x05 << 4) | (rx_data & 0x0F);
      break;
  }

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
}

/**
 * @brief function to enable high performance mode in accelerometer
 *
 * High performance mode is enabled by setting one of the following ODR values: 416 Hz, 833 Hz, 1.66 kHz, 3.33 kHz and 6.66 kHz
 */
void LSM6DS3_set_accel_high_performance_mode(uint16_t value)
{
  twim_ret_status err_code;
  uint8_t rx_data;
  // uint8_t tx_data[2] = {CTRL1_XL, 0};
  uint8_t tx_data[2];

  // set XL_HM_MODE bit to 1 in CTRL6_C to enable high performance mode.
  tx_data[0] = CTRL6_C;
  tx_data[1] = 0x00;

//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  uint8_t ctrl1_xl = CTRL1_XL;  
  hal_nop_delay_ms(10);

  // read CTRL1_XL register to obtain current parameters.
  err_code = hal_twim_tx_rx (&ctrl1_xl, 1, &rx_data, sizeof(rx_data));
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);

  tx_data[0] = CTRL1_XL;
  // bit mask CTRL1_XL to avoid losing previously set parameters. Only change ODR_XL bits.
  switch(value) {
    case 416:
      tx_data[1] |= (0x06 << 4) | (rx_data & 0x0F);
      break;

