Appiko/nrf5x-firmware/codebase/peripheral_modules/LSM6DS3.c
    case 833:
      tx_data[1] |= (0x07 << 4) | (rx_data & 0x0F);
      break;

    default:
    case 1660:
      tx_data[1] |= (0x08 << 4) | (rx_data & 0x0F);
      break;

    case 3330:
      tx_data[1] |= (0x09 << 4) | (rx_data & 0x0F);
      break;

    case 6660:
      tx_data[1] |= (0x0A << 4) | (rx_data & 0x0F);
      break;
  }

  err_code = hal_twim_tx (tx_data, sizeof(tx_data));
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(10);
}


/**
 * @brief function to read accelerometer data
 */
void LSM6DS3_read_accl_data(int16_t *x_axis, int16_t *y_axis, int16_t *z_axis)
{
  twim_ret_status err_code;
//  uint8_t status = 0;
  uint8_t data[6];

//  LSM6DS3_set_accel_high_performance_mode(settings.accel_samplerate);

//  do {
//    err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, STATUS_REG, &status, sizeof(status), false);
//      uint8_t status_reg = STATUS_REG;
//    err_code = hal_twim_tx_rx (&status_reg, 1, &status, sizeof(status));
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//  hal_nop_delay_ms(10);
//  } while(!(status & 0x01));
  
  uint8_t outxl = OUTX_L_XL;

  err_code = hal_twim_tx_rx (&outxl, 1, data, sizeof(data));
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, OUTX_L_XL, data, sizeof(data), true);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
  hal_nop_delay_ms(100);
  if(err_code == 0)
  {
      
  }

//  LSM6DS3_set_accel_power_down_mode();

  *x_axis = (data[1] << 8) | data[0];
  *y_axis = (data[3] << 8) | data[2];
  *z_axis = (data[5] << 8) | data[4];
}

/**
 * @brief function to compute raw accelerometer data in g.
 *
 * Multiply linear acceleration sensitivity with raw_data. Divide the product by 1000 to obtain value in g.
 * Refer table 4.1 on page 19 of LSM6DS3 datasheet.
 */
int16_t LSM6DS3_accelData_in_g(int16_t raw_data)
{
  return (int16_t)((float)((raw_data * 0.061 * (settings.accel_range >> 1)) / 10 ));
}


/**
 * @brief function to enable sleep mode in gyroscope
 */
//void LSM6DS3_set_gyro_sleep_mode()
//{
//  twim_ret_status err_code;
//
//  // set SLEEP_G bit in CTRL4_C register to enable sleep mode
//  uint8_t tx_data[2] = {CTRL4_C, LSM6DS3_IMU_SLEEP_G_ENABLED};
//
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//}
//
/**
 * @brief function to disable sleep mode in gyroscope
 */
//void LSM6DS3_set_gyro_active_mode()
//{
//  twim_ret_status err_code;
//
//  // reset SLEEP_G bit in CTRL4_C register to disable sleep mode
//  uint8_t tx_data[2] = {CTRL4_C, LSM6DS3_IMU_SLEEP_G_DISABLED};
//
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//}
//
/**
 * @brief functioon to read gyroscope data.
 */
//void LSM6DS3_read_gyro_data(int16_t *gyro_x, int16_t *gyro_y, int16_t *gyro_z)
//{
//  twim_ret_status err_code;
//  uint8_t status = 0;
//  uint8_t data[6];
//
//  LSM6DS3_set_gyro_active_mode();
//
//  do {
////    err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, STATUS_REG, &status, sizeof(status), false);
//  } while(!(status & 0x02));
//
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, OUTX_L_G, data, sizeof(data), true);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  LSM6DS3_set_gyro_sleep_mode();
//
//  *gyro_x = (data[1] << 8) | data[0];
//  *gyro_y = (data[3] << 8) | data[2];
//  *gyro_z = (data[5] << 8) | data[4];
//}
//
/**
 * @brief function to compute raw gyroscope data in degrees per second (dps).
 *
 * Multiply raw data with angular rate sensitivity.
 * Refer table 4.1 on page 19 of LSM6DS3 datasheet
 */
//float LSM6DS3_gyroData_in_dps(int16_t raw_data)
//{
//  uint8_t gyro_range_divisor;
//
//  if (settings.gyro_range == 245) {
//    gyro_range_divisor = 2;
//  }
//  else {
//    gyro_range_divisor = settings.gyro_range / 125;
//  }
//
//  return ((float) ((raw_data * 4.375 * gyro_range_divisor) / 1000 ));
//}
//
/**
 * @brief function to configure FIFO
 */
//void LSM6DS3_FIFO_config(void)
//{
//  twim_ret_status err_code;
//  uint8_t tx_data[2];
//
//  // masking the threshold value in FIFO_CTRL1 register.
//  tx_data[0] = FIFO_CTRL1;
//  tx_data[1] = settings.FIFO_threshold & 0x00FF;
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // masking the threshold value in FIFO_CTRL2 register.
//  tx_data[0] = FIFO_CTRL2;
//  tx_data[1] = (settings.FIFO_threshold & 0x0F00) >> 8;
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // set up decimation factor for accelerometer and gyroscope
//  tx_data[0] = FIFO_CTRL3;
//  tx_data[1] = 0;
//  if(settings.accel_FIFO_enable == 1) {
//    tx_data[1] |= (settings.accel_FIFO_decimation & 0x07);
//  }
//
//  if (settings.gyro_FIFO_enable == 1) {
//    tx_data[1] |= ((settings.gyro_FIFO_decimation & 0x07) << 3);
//  }
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // configure sensor hub (if any)
//  // set decimation and ONLY_HIGH_DATA bit here
//  // tx_data[0] = FIFO_CTRL4;
//
//  // configure FIFO_CTRL5 register
//  tx_data[0] = FIFO_CTRL5;
//  // set FIFO ODR
//  tx_data[1] = 0;
//  switch(settings.FIFO_samplerate) {
//    default:
//    case 13:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_13Hz;
//            break;
//
//    case 26:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_26Hz;
//            break;
//
//    case 52:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_52Hz;
//            break;
//
//    case 104:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_104Hz;
//            break;
//
//    case 208:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_208Hz;
//            break;
//
//    case 416:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_416Hz;
//            break;
//
//    case 833:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_833Hz;
//            break;
//
//    case 1660:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_1660Hz;
//            break;
//
//    case 3330:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_3330Hz;
//            break;
//
//    case 6660:
//            tx_data[1] |= LSM6DS3_IMU_ODR_FIFO_6660Hz;
//            break;
//  }
//
//  // set FIFO mode
//  switch(settings.FIFO_mode) {
//    default:
//    case 0:
//          tx_data[1] |= LSM6DS3_IMU_FIFO_MODE_BYPASS;
//          break;
//
//    case 1:
//            tx_data[1] |= LSM6DS3_IMU_FIFO_MODE_FIFO;
//            break;
//
//    case 3:
//            tx_data[1] |= LSM6DS3_IMU_FIFO_MODE_STF;
//            break;
//
//    case 4:
//            tx_data[1] |= LSM6DS3_IMU_FIFO_MODE_BTS;
//            break;
//
//    case 6:
//            tx_data[1] |= LSM6DS3_IMU_FIFO_MODE_STREAM;
//            break;
//  }
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//}

/**
 * @brief function to read FIFO status
 */
//uint16_t LSM6DS3_read_FIFO_status(void)
//{
//  twim_ret_status err_code;
//  uint8_t data[2];
//  //uint8_t tx_data[2];
//  uint16_t status = 0;
//
//  /*// set BDU bit in CTRL3_C registers
//  tx_data[0] = CTRL3_C;
//  tx_data[1] = 0x40;
//  err_code = nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);*/
//
//  // read FIFO_STATUS1 and FIFO_STATUS2 registers
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, FIFO_STATUS1, data, sizeof(data), true);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//  status = (data[1] << 8) | data[0];
//
//  return status;
//}

/**
 * @brief function to read FIFO buffer
 */
//int16_t LSM6DS3_read_FIFO_buffer()
//{
//  twim_ret_status err_code;
//  uint8_t read_data[2];
//  int16_t data = 0;
//
//  // read FIFO_DATA_OUT_L and FIFO_DATA_OUT_H registers
//  err_code = read_register(p_twi_sensors, LSM6DS3_ADDR, FIFO_DATA_OUT_L, read_data, sizeof(read_data), true);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//  data = (read_data[1] << 8) | read_data[0];
//
//  return data;
//}

/**
 * @brief function to empty FIFO buffer
 */
//void LSM6DS3_clear_FIFO_buffer(void)
//{
//  // Read FIFO data and dump it.
//  while((LSM6DS3_read_FIFO_status() & 0x1000) == 0) {
//    LSM6DS3_read_FIFO_buffer();
//  }
//}

/**
 * @brief function to configure tap functionality
 */
//void LSM6DS3_tap_detect_config()
//{
//  twim_ret_status err_code;
//  uint8_t tx_data[2];
//
//  // Enable tap detection on X, Y, Z axis, but do not latch output
//  tx_data[0] = TAP_CFG;
//  tx_data[1] = 0x0E;
//  err_code =  nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // Set tap threshold
//  tx_data[0] = TAP_THRS_6D;
//  tx_data[1] = 0x03;
//  err_code =  nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // Set Duration, Quiet and Shock time windows
//  tx_data[0] = INT_DUR2;
//  tx_data[1] = 0x7F;
//  err_code =  nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // Single & Double tap enabled (SINGLE_DOUBLE_TAP = 1)
//  tx_data[0] = WAKE_UP_THRS;
//  tx_data[1] = 0x80;
//  err_code =  nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//
//  // Single tap interrupt driven to INT1 pin -- enable latch
//  tx_data[0] = MD2_CFG;
//  tx_data[1] = 0x48;
//  err_code =  nrf_drv_twi_tx(&p_twi_sensors, LSM6DS3_ADDR, tx_data, sizeof(tx_data), false);
//  log_printf("Status : %d, %d\n", err_code, __LINE__);
//}
